{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Inventiva.co.in"},"author":null,"title":"New Disinfection Robot To Aid Cleaners In COVID-19 Fight - Inventiva","description":"Scientists have developed a semi-autonomous robot that can disinfect large surfaces quickly, and reduce the risk of cleaners picking up the novel coronavirus fr","url":"https://www.inventiva.co.in/stories/inventiva/new-disinfection-robot-to-aid-cleaners-in-covid-19-fight/","urlToImage":"https://i1.wp.com/www.inventiva.co.in/wp-content/uploads/2020/04/ntusingapore.jpg","publishedAt":"2020-04-15T08:15:56Z","content":"Scientists have developed a semi-autonomous robot that can disinfect large surfaces quickly, and reduce the risk of cleaners picking up the novel coronavirus from potentially contaminated areas.\r\nThe researchers from Nanyang Technological University (NTU) in … [+2820 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Lifestyle Desk","title":"Raw turmeric can help boost your immunity; here’s how - The Indian Express","description":"Turmeric goes into almost every curry and savoury that gets cooked in our kitchens. It helps the process of cooking and adds nutritional value to it.","url":"https://indianexpress.com/article/lifestyle/health/raw-turmeric-boost-immunity-benefits-6340737/","urlToImage":"https://images.indianexpress.com/2020/03/turmeric.jpg?w=759","publishedAt":"2020-04-15T07:17:37Z","content":"Turmeric is known to have a lot of health benefits. (Source: Getty Images)Over the years, turmeric has become a popular ingredient for all those people who believe in healthy living. Though the western world came to realise the benefits of this wonder spice c… [+3760 chars]"},{"source":{"id":null,"name":"Cnbctv18.com"},"author":null,"title":"ICMR reports detection of coronavirus in Indian bats highlights need for screening - CNBCTV18","description":"ICMR reports detection of coronavirus in Indian bats highlights need for screening. Get latest Healthcare online at cnbctv18.com","url":"https://www.cnbctv18.com/healthcare/icmr-reports-detection-of-coronavirus-in-indian-bats-highlights-need-for-screening-5692551.htm/","urlToImage":"https://images.cnbctv18.com/wp-content/uploads/2020/03/coronavirus-COVID-19-tests-India-768x576.jpg","publishedAt":"2020-04-15T06:39:14Z","content":"The detection of potentially pathogenic coronavirus in Indian bats stresses the need for enhancing screening for novel viruses in them, according to a study by the Indian Council of Medical Research (ICMR).\r\nThis study was a step towards understanding the cor… [+3722 chars]"},{"source":{"id":null,"name":"9news.com.au"},"author":"Zarisha Bradley","title":"Copper-coated doorknobs to kill COVID-19? Darwin company makes breakthrough discovery - 9News","description":"<p>A Darwin-based company says it has made a breakthrough discovery in the eradication of the coronavirus through a common household object: copper-coated door handles, rails and touch plates.</p>","url":"https://www.9news.com.au/national/coppercoated-doorknobs-to-kill-covid-19-darwin-company-makes-breakthrough-discovery/33670001-d65b-46c8-9199-303da229508d","urlToImage":"https://imageresizer.static9.net.au/IsZSAxxNfTBBI_6b0KhVc-23uJQ=/0x361:3024x2062/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F64ccb800-69ae-4e85-abed-91a177c12bfd","publishedAt":"2020-04-15T06:27:26Z","content":"Property News: Working from home: Tips for creating a work space and staying productive - domain.com.au"},{"source":{"id":null,"name":"Thethaiger.com"},"author":"Sean Kelly","title":"Thai Covid 19 “Super Spreader” song goes… VIRAL - The Thaiger","description":"After the successful Vietnamese PSA song and #EndCov campaigns educating the population, Thai government has developed its own viral campaign","url":"https://thethaiger.com/coronavirus/thai-covid-19-super-spreader-song-goes-viral","urlToImage":"https://thethaiger.com/wp-content/uploads/2020/04/Princess-Sings.jpg","publishedAt":"2020-04-15T05:37:30Z","content":"“Don’t just think of fun, or you’ll suffer from CovidIf you can’t recover, you could die!”\r\nAfter witnessing the successful Vietnamese public service song and #EndCov campaigns educating the Vietnamese population to wash their hands and take action in the bat… [+2261 chars]"},{"source":{"id":null,"name":"Theprint.in"},"author":"Kristen V Brown","title":"New research shows how silent carriers spread coronavirus - ThePrint","description":"Silent carriers of coronavirus may play a significant role in spreading the disease, according to research conducted in Iceland.","url":"https://theprint.in/health/new-research-shows-how-silent-carriers-spread-coronavirus/402005/","urlToImage":"https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/coronavirus-testing-scaled-e1586165575726.jpg","publishedAt":"2020-04-15T04:53:05Z","content":"San Francisco: Silent carriers of the virus that causes Covid-19 may play a significant role in spreading the disease, according to research conducted in Iceland.\r\nThe findings, to be published in the New England Journal of Medicine on Tuesday, provide a stri… [+2759 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"PTI","title":"Search for a COVID-19 vaccine heats up in China, US - Livemint","description":"China's CanSino Biologics has begun the second phase of testing its vaccine candidate.On the WHO's list are a wide variety of ways to make vaccines -- so if one approach doesn't pan out, hopefully another one will","url":"https://www.livemint.com/news/world/search-for-a-covid-19-vaccine-heats-up-in-china-us-11586922006284.html","urlToImage":"https://images.livemint.com/img/2020/04/15/600x338/361302615_0-4_1586922069769_1586922083126.jpg","publishedAt":"2020-04-15T03:48:02Z","content":"WASHINGTON :\r\nThree potential COVID-19 vaccines are making fast progress in early-stage testing in volunteers in China and the U.S., but it's still a long road to prove if they'll really work. China's CanSino Biologics has begun the second phase of testing it… [+2694 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"Thailand extends ban on passenger flights until end-April - Reuters","description":"Thailand has extended a ban on incoming passenger flights until the end of April in a bid to curb the coronavirus outbreak, the country's aviation body said on Wednesday.","url":"https://in.reuters.com/article/health-coronavirus-thailand-idINL3N2C310N","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png","publishedAt":"2020-04-15T03:44:00Z","content":"BANGKOK, April 15 (Reuters) - Thailand has extended a ban on incoming passenger flights until the end of April in a bid to curb the coronavirus outbreak, the country’s aviation body said on Wednesday. \r\nThe ban was first introduced on April 4, and the Civil A… [+1203 chars]"},{"source":{"id":null,"name":"Deccanherald.com"},"author":"AFP","title":"On-off social distancing may be needed until 2022 to prevent coronavirus spread: Harvard study - Deccan Herald","description":"A one-time lockdown won't halt the novel coronavirus and repeated periods of social distancing may be required into 2022 to prevent hospitals from being overwhelmed, Harvard scientists who modeled the pandemic's trajectory said Tuesday. Their study comes as t…","url":"https://www.deccanherald.com/science-and-environment/on-off-social-distancing-may-be-needed-until-2022-to-prevent-coronavirus-spread-harvard-study-825551.html","urlToImage":"https://www.deccanherald.com/sites/dh/files/article_images/2020/04/15/iStock-506551290-1586921055.jpg","publishedAt":"2020-04-15T03:24:15Z","content":"A one-time lockdown won't halt the novel coronavirus and repeated periods of social distancing may be required into 2022 to prevent hospitals from being overwhelmed, Harvard scientists who modeled the pandemic's trajectory said Tuesday.\r\nTheir study comes as … [+3562 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"PTI","title":"ICMR study finds presence of 'bat coronavirus' in two Indian bat species - Livemint","description":"There is no evidence or research to claim that these bat coronaviruses can cause disease in humans.Twenty-five bats of Rousettus and Pteropus species from Kerala, Himachal Pradesh, Puducherry and Tamil Nadu were found positive for BtCoV in Kerala, Himachal Pr…","url":"https://www.livemint.com/news/india/icmr-study-finds-presence-of-bat-coronavirus-in-two-indian-bat-species-11586920131521.html","urlToImage":"https://images.livemint.com/img/2020/04/15/600x338/bats-kK2D--621x414@LiveMint_1586920737399.JPG","publishedAt":"2020-04-15T03:22:30Z","content":"NEW DELHI :\r\nAs the world grapples with the coronavirus pandemic, researchers have found the presence of a different kind of coronavirus -- bat coronavirus (BtCoV) -- in two bat species from Kerala, Himachal Pradesh, Puducherry and Tamil Nadu, according to a … [+3588 chars]"},{"source":{"id":null,"name":"Nytimes.com"},"author":"Karen Weintraub","title":"Are You Nervously Wiping Fresh Veggies? Stop. Widespread Disinfecting May Not be Killing the Coronavirus - News18","description":"Spraying streets and inside buildings might calm a worried public, but it’s too early to know whether such efforts reduce transmission.","url":"https://www.nytimes.com/2020/04/14/health/disinfectant-coronavirus.html","urlToImage":"https://static01.nyt.com/images/2020/04/14/science/14VIRUS-DISINFECT/14VIRUS-DISINFECT-facebookJumbo.jpg","publishedAt":"2020-04-15T03:09:51Z","content":"Claims made on Facebook that helicopters would be spraying disinfectant in New York City were false, The Associated Press reported.\r\nDr. Santarpia said that disinfecting surfaces indoors, though in airports, for example is a good idea. You want to make sure a… [+1299 chars]"},{"source":{"id":null,"name":"Indiatoday.in"},"author":null,"title":"Coronavirus in India: Cobot to serve Covid-19 positive patient in Jharkhand's Chaibasa - India Today","description":"A Jharkhand IAS officer has developed a \"cobot\" that deals with the coronavirus positive and quarantined patient on its own, minimizing the involvement and interaction of doctors, nurses, and medical staff.","url":"https://www.indiatoday.in/india/story/coronavirus-in-india-cobot-to-serve-the-covid-19-positive-patient-in-jharkhand-s-chaibasa-1667055-2020-04-15","urlToImage":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/unnamed_3-647x363.jpeg?646DGOMWKQ3QYUFV11R5l2L.yA5Bbiwk","publishedAt":"2020-04-15T02:37:05Z","content":"Jharkhand's IAS officer is leading the war against coronavirus by his new and trend-setting exemplary inventions. He is DDC Chaibasa Aditya Ranjan, an engineering graduate from BIT Mesra. Keenly interested in robotics, he developed a \"cobot\" that deals with t… [+1694 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"News18","title":"Repeated Periods of Social Distancing May be Needed Until 2022, Says Harvard Study - News18","description":"Their study comes as the US enters the peak of its COVID-19 caseload and states eye an eventual easing of tough lockdown measures.","url":"https://www.news18.com/news/world/repeated-periods-of-social-distancing-may-be-needed-until-2022-says-harvard-study-2577919.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/03/Social-Distancing-to-Prevent-Coronavirus-Spread-2.jpg","publishedAt":"2020-04-15T02:34:33Z","content":"Washington: A one-time lockdown won't halt the novel coronavirus and repeated periods of social distancing may be required into 2022 to prevent hospitals from being overwhelmed, Harvard scientists who modeled the pandemic's trajectory said Tuesday.\r\nTheir stu… [+3294 chars]"},{"source":{"id":null,"name":"Socialnews.xyz"},"author":null,"title":"COVID-19 death toll tops 12,000 in UK - SocialNews.XYZ","description":"London, April 15 (SocialNews.XYZ) The death toll of those hospitalized in Britain who tested positive for the novel coronavirus reached 12,107, a daily increase of 778, the Department of Health and Social Care said. As... - Social News XYZ","url":"https://www.socialnews.xyz/2020/04/14/covid-19-death-toll-tops-12000-in-uk/","urlToImage":"https://i1.wp.com/www.socialnews.xyz/wp-content/uploads/2020/03/03/adad7d94f43082aed181e66c8787e999.jpg?fit=1070%2C936&quality=90&zoom=1&ssl=1","publishedAt":"2020-04-15T02:00:14Z","content":"London, April 15 (SocialNews.XYZ) The death toll of those hospitalized in Britain who tested positive for the novel coronavirus reached 12,107, a daily increase of 778, the Department of Health and Social Care said.\r\nAs of Tuesday morning, a total of 93,873 c… [+2282 chars]"},{"source":{"id":null,"name":"Hindustantimes.com"},"author":"Associated Press","title":"Covid-19 update: Health care workers are 10%-20% of US coronavirus cases, says officials - Hindustan Times","description":"Compared with US cases overall, larger proportions of diagnosed health care workers were women, were white, and were young or middle-aged adults. That’s consistent with the demographics of who works in health care, researchers said.","url":"https://www.hindustantimes.com/world-news/covid-19-update-health-care-workers-are-10-20-of-us-coronavirus-cases-says-officials/story-AOblnVARRcspgthTw3QR2L.html","urlToImage":"https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/15/Pictures/emergency-outbreak-brooklyn-coronavirus-disease-outside-maimonides_b64e21d2-7eba-11ea-bf35-36f2d834daf8.jpg","publishedAt":"2020-04-15T01:52:40Z","content":"Between 10% and 20% of US coronavirus cases are health care workers, though they tended to be hospitalized at lower rates than other patients, officials reported Tuesday.\r\nThe Centers for Disease Control and Prevention reported the first national data on how … [+2055 chars]"},{"source":{"id":null,"name":"Wcvb.com"},"author":"Mark Albert","title":"Want to know if you have immunity from the coronavirus? A new study seeks volunteers - WCVB Boston","description":"A new study hopes to find out how many adults in the United States have COVID-19 antibodies — especially people with no confirmed history of getting infected with it.","url":"https://www.wcvb.com/article/want-to-know-if-you-now-have-immunity-from-the-coronavirus-a-new-study-seeks-volunteers/32149749","urlToImage":"https://kubrick.htvapps.com/vidthumb/images/still-1586891319.jpg?crop=1xw:1xh;center,top&resize=1200:*","publishedAt":"2020-04-15T01:28:00Z","content":"Scientists and health experts say one of the keys to reviving the economy is knowing who could still become infected by COVID-19, and who has had it and recovered even without knowing it.\r\n\"If we can identify these people, we can start to understand why their… [+1611 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Stay at home orders and the affects on teen mental health - KOAA 5","description":"spotting the signs of anxiety and depression among teens. How the coronavirus is affecting their mental health and development","url":"https://www.youtube.com/watch?v=zh9hQAabiqY","urlToImage":"https://i.ytimg.com/vi/zh9hQAabiqY/maxresdefault.jpg","publishedAt":"2020-04-15T00:50:00Z","content":null},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Anti-malarial tablets sent to 14 cities - Newsy","description":"Hydroxychloroquine is used to treat malaria and some autoimmune diseases, but there's little evidence it can treat the coronavirus. Learn more about this sto...","url":"https://www.youtube.com/watch?v=CIDKsZeVS24","urlToImage":"https://i.ytimg.com/vi/CIDKsZeVS24/maxresdefault.jpg","publishedAt":"2020-04-15T00:47:58Z","content":null},{"source":{"id":null,"name":"Bloombergquint.com"},"author":"Faye Flam","title":"Post-Virus Reopening Is More About Ethics than Science - BloombergQuint","description":"The question can’t be left entirely up to experts. It’s not a safety problem so much as an ethical one.","url":"https://www.bloombergquint.com/gadfly/reopening-the-economy-post-coronavirus-is-about-ethics","urlToImage":"https://images.assettype.com/bloombergquint%2F2020-04%2Ff28adc3d-f35f-4f15-b567-916d5becb79d%2F361306006.jpg?rect=0%2C358%2C3998%2C2099&w=1200&auto=format%2Ccompress&ogImage=true","publishedAt":"2020-04-14T23:21:46Z","content":""},{"source":{"id":null,"name":"Nytimes.com"},"author":"Reuters","title":"UK Promises to Test All Care Home Residents and Staff With Coronavirus Symptoms - The New York Times","description":"Britain promised on Wednesday to test all residents and employees of nursing homes who have COVID-19 symptoms after official data showed the death toll from the pandemic was far higher when the elderly in care were included.","url":"https://www.nytimes.com/reuters/2020/04/14/world/europe/14reuters-health-coronavirus-britain-carehomes.html","urlToImage":"https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png","publishedAt":"2020-04-14T23:09:00Z","content":"On Tuesday, the Office for National Statistics said 5,979 people in England had died by April 3 with COVID-19, the respiratory disease caused by the virus, mentioned on their death certificates - 15% higher than numbers published by the health service. \r\nDail… [+758 chars]"}]}