{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Deccanherald.com"},"author":"Suraksha P","title":"Will do whatever it takes to ensure that all of us come out of this, says recovered Bengaluru COVID-19 patient - Deccan Herald","description":"Karnataka Medical Education Minister Dr K Sudhakar and Health Minister B Sriramulu symbolically launched the clinical trials for convalescent plasma therapy here on Saturday at Victoria Hospital in Bengaluru.  Two patients from the state who have recovered fr…","url":"https://www.deccanherald.com/city/top-bengaluru-stories/will-do-whatever-it-takes-to-ensure-that-all-of-us-come-out-of-this-says-recovered-bengaluru-covid-19-patient-829762.html","urlToImage":null,"publishedAt":"2020-04-25T10:07:38Z","content":"Karnataka Medical Education Minister Dr K Sudhakar and Health Minister B Sriramulu symbolically launched the clinical trials for convalescent plasma therapy here on Saturday at Victoria Hospital in Bengaluru. \r\nTwo patients from the state who have recovered f… [+2654 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"'No evidence' yet that recovered COVID patients cannot be reinfected: WHO - Reuters India","description":"The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.","url":"https://in.reuters.com/article/health-coronavirus-who-idINKCN2270F9","urlToImage":null,"publishedAt":"2020-04-25T09:53:00Z","content":"GENEVA (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a scientific brief, the Uni… [+1753 chars]"},{"source":{"id":null,"name":"Ibtimes.co.in"},"author":"Nirmal Narayanan","title":"Is coronavirus sexually transmitted? Medical expert answers - International Business Times, India Edition","description":"A previous study report had suggested that men are more prone to the severity of coronavirus infection due to the presence of testicles in their body.","url":"https://www.ibtimes.co.in/coronavirus-sexually-transmitted-medical-expert-answers-818377","urlToImage":null,"publishedAt":"2020-04-25T09:40:27Z","content":"Top US vaccine expert was 'fired'\r\nThe novel coronavirus that originated in a Wuhan seafood market has been spreading chaos all across the globe for the past four months. With death toll nearing 2,00,000, Covid-19 has affected people in all countries irrespec… [+1912 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"Bloomberg","title":"Why Europe’s capital has world’s highest virus death rate - Livemint","description":"Despite having only 11 million people, the country has reported more deaths from the disease than China.With some 57 fatalities per 100,000 inhabitants, it has the highest per-capita death rate in the world","url":"https://www.livemint.com/news/world/why-europe-s-capital-has-world-s-highest-virus-death-rate-11587806581013.html","urlToImage":null,"publishedAt":"2020-04-25T09:33:43Z","content":"In an art-deco building in the heart of Brussels, Belgiums leading scientists gather daily to announce the countrys coronavirus toll. Its been grim reading.Despite having only 11 million people, the country has reported more deaths from the disease than China… [+4515 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: Study - The Financial Express","description":null,"url":"https://news.google.com/__i/rss/rd/articles/CBMilAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2NvdHRvbi1uYXR1cmFsLXNpbGstY2hpZmZvbi1tYWtlLWJlc3QtbWF0ZXJpYWxzLWZvci1ob21lbWFkZS1tYXNrcy1hZ2FpbnN0LWNvdmlkLTE5LXN0dWR5LzE5Mzk0NDYv0gGZAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2xpZmVzdHlsZS9oZWFsdGgvY290dG9uLW5hdHVyYWwtc2lsay1jaGlmZm9uLW1ha2UtYmVzdC1tYXRlcmlhbHMtZm9yLWhvbWVtYWRlLW1hc2tzLWFnYWluc3QtY292aWQtMTktc3R1ZHkvMTkzOTQ0Ni9saXRlLw?oc=5","urlToImage":null,"publishedAt":"2020-04-25T09:04:27Z","content":null},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Health workers are on the frontline of the COVID-19 pandemic - eNCA","description":"Health workers are on the frontline of the covid-19 pandemic, some get infected and even succumb to the virus. Retshidisitswe Kotane, who recently graduated,...","url":"https://www.youtube.com/watch?v=8ZrrAJkQu2w","urlToImage":null,"publishedAt":"2020-04-25T08:34:11Z","content":null},{"source":{"id":null,"name":"Thehealthsite.com"},"author":"Jahnavi Sarma","title":"Delhi enters stage 2 of COVID-19 transmission: Can we avoid stage 3? - TheHealthSite","description":"Though officials say that the situation is under control Delhi health minister says that the state is now in stage 2 of COVID-19 transmission.","url":"https://www.thehealthsite.com/news/delhi-enters-stage-2-of-covid-19-transmission-can-we-avoid-stage-3-741725/","urlToImage":null,"publishedAt":"2020-04-25T08:06:40Z","content":"The COVID-19 pandemic is claiming more and more victims in India and cases in the National capital has seen a surge with more than 1,500 people testing positive to the virus. The deadly contagion has so far claimed 53 victims in Delhi as far official reports.… [+3202 chars]"},{"source":{"id":null,"name":"Gulfnews.com"},"author":"AFP","title":"COVID-19: Does sunlight rapidly destroy the coronavirus? | Americas - Gulf News","description":"Experts urge caution after US department of homeland security makes claim","url":"https://gulfnews.com/world/americas/covid-19-does-sunlight-rapidly-destroy-the-coronavirus-1.1587801920020","urlToImage":null,"publishedAt":"2020-04-25T08:02:36Z","content":"Generic image used for illustrative purposes\r\n Image Credit: Pixabay\r\nWashington:  Does sunlight rapidly destroy the coronavirus? A White House presentation on a mysterious government study says so - but some scientists have called for caution as we await mor… [+4257 chars]"},{"source":{"id":null,"name":"Indiatoday.in"},"author":null,"title":"World Malaria Day 2020: Date, theme, history, slogans and quotes - India Today","description":"World Malaria Day or WMD is observed on April 25 every year. The day aimed at taking urgent action in the control of the deadly disease. The theme of World Malaria Day 2020 is \"Zero malaria starts with me.\"","url":"https://www.indiatoday.in/information/story/world-malaria-day-2020-date-theme-history-facts-slogans-and-quotes-1670910-2020-04-25","urlToImage":null,"publishedAt":"2020-04-25T07:21:55Z","content":"Malaria is a life-threatening disease which is caused by the bites of infected mosquitoes. It is the Female Anopheles mosquitoes who spread the Plasmodium parasite through their saliva, which causes malaria.\r\nHowever, it is a preventable and treatable infecti… [+4230 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"ANI","title":"106-year-old woman who survived Spanish Flu, now beats coronavirus too - Livemint","description":"Ana del Valle is the oldest survivor of the pandemic outbreaks in Spain.Ana was born in October 1913 and in less than six months she will turn 107","url":"https://www.livemint.com/news/world/106-year-old-woman-who-survived-spanish-flu-now-beats-coronavirus-too-11587798144700.html","urlToImage":null,"publishedAt":"2020-04-25T07:15:52Z","content":"Madrid: We may have all heard that miracles do happen, but sadly not all of us have the chance to witness them in our daily lives, especially during a pandemic today which brings the world to a standstill.Citing a similar story of survival, The Olive Press, a… [+2495 chars]"},{"source":{"id":null,"name":"Indiatoday.in"},"author":null,"title":"e-Agenda AajTak: Not just stay at home but also do yoga at home, says Ramdev - India Today","description":"e-Agenda Aaj Tak: Yoga guru Ramdev said people should not just stay and work at home, but they must also perform yoga at home.","url":"https://www.indiatoday.in/india/story/e-agenda-aajtak-yoga-ramdev-coronavirus-pandemic-lockdown-1670908-2020-04-25","urlToImage":null,"publishedAt":"2020-04-25T06:56:14Z","content":"In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga guru Ramdev on Saturday.\r\nRamdev was speaking at a special session at the e-Agenda Aaj Tak.\r\n… [+1005 chars]"},{"source":{"id":null,"name":"Expresshealthcare.in"},"author":"Sanjiv Das","title":"Experts stress on radiology preparedness for COVID 19 - Express Healthcare","description":"Like any other health professionals, radiologists are doing their bit to safeguard their patients with limited resources.  It’s time they get ready to set protocol for preparedness during and post epidemicIn the wake of the global health crisis due t","url":"https://www.expresshealthcare.in/covid19-updates/experts-stress-on-radiology-preparedness-for-covid-19/419329/","urlToImage":null,"publishedAt":"2020-04-25T06:20:00Z","content":"Like any other health professionals, radiologists are doing their bit to safeguard their patients with limited resources.  Its time they get ready to set protocol for preparedness during and post epidemic\r\nIn the wake of the global health crisis due to COVID-… [+13798 chars]"},{"source":{"id":null,"name":"Firstpost.com"},"author":null,"title":"World Malaria Day 2020: WHO's anti-malaria campaign and target to eliminate malaria from 35 more... - Firstpost","description":"According to WHO reports, malaria affected more than 228 million people in the world in 2018 and killed about 405,000 people globally in the same year.","url":"https://www.firstpost.com/health/world-malaria-day-2020-whos-anti-malaria-campaign-and-target-to-eliminate-malaria-from-35-more-countries-by-2030-8298691.html","urlToImage":null,"publishedAt":"2020-04-25T06:06:06Z","content":null},{"source":{"id":null,"name":"Yourtango.com"},"author":"https://www.yourtango.com/users/nicole-pomarico","title":"Covid-19 Strokes: Coronavirus Is Causing Strokes In Young Adults, Doctors Warn - YourTango","description":"This is a pretty scary possible side effect of the virus.","url":"https://www.yourtango.com/2020333481/covid-19-strokes-in-young-adults","urlToImage":null,"publishedAt":"2020-04-25T05:43:17Z","content":"This is a pretty scary possible side effect of the virus.\r\nSo far, doctors have believed that coronavirus has had a more mild impact on young adults, but now, they've learned new information that could change that belief.\r\nNow that we're a few months into the… [+3510 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"World leaders to launch COVID-19 drugs, vaccine plan: WHO - ARIRANG NEWS","description":"WHO \"코로나19 치료제•백신 개발 협력안 제시\" World leaders have pledged to work together in a landmark collaboration, to speed up the development of drugs, tests and vaccine...","url":"https://www.youtube.com/watch?v=XC4JHNYFmk0","urlToImage":null,"publishedAt":"2020-04-25T04:57:01Z","content":"WHO \"19 \"\r\nWorld leaders have pledged to work together in a landmark collaboration, to speed up the development of drugs, tests and vaccines to diagnose and treat COVID-19.According to the World Health Organization on Friday, world leaders including French Pr… [+495 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News - WION","description":"Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News In France, traces of the novel coronavirus were discovered in 4 out of 27 s...","url":"https://www.youtube.com/watch?v=4ZJVtFYyA58","urlToImage":null,"publishedAt":"2020-04-25T04:35:19Z","content":"Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News\r\nIn France, traces of the novel coronavirus were discovered in 4 out of 27 samples of the non-potable water, which is supplied in Paris.\r\n#ParisCoronavirus#FranceCoronavirusDeat… [+1130 chars]"},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"Aswathi Pacha","title":"Stop villainising bats, say scientists and conservationists - The Hindu","description":"The mammals do not spread COVID-19, they say","url":"https://www.thehindu.com/sci-tech/energy-and-environment/stop-villainising-bats-say-scientists-and-conservationists/article31429962.ece","urlToImage":null,"publishedAt":"2020-04-25T04:24:55Z","content":"Unverified news and social media posts linking bats to the COVID-19 outbreak have led to widespread antipathy and there have been increasing incidents of the public destroying bat roosts and smoking them out. To raise awareness, 64 chiropterologists (those wh… [+2199 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"News18","title":"Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - News18","description":"Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.","url":"https://www.news18.com/news/world/coronavirus-detected-on-air-pollution-particles-that-may-carry-it-over-long-distances-scientists-warn-2591919.html","urlToImage":null,"publishedAt":"2020-04-25T03:39:15Z","content":"The novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in more number of people contracting it, The Guardian reported.\r\nThe work is still in the initi… [+2716 chars]"},{"source":{"id":null,"name":"Hindustantimes.com"},"author":"Hindustan Times","title":"A month in lockdown, vaccines in human trials give hope: Covid-19 news today - Hindustan Times","description":"A preview of the important Covid-19 news from India and world today","url":"https://www.hindustantimes.com/india-news/a-month-in-lockdown-vaccines-in-human-trials-give-hope-covid-19-news-today/story-Y9XTbYJNVJFRhle8ubkTEL.html","urlToImage":null,"publishedAt":"2020-04-25T02:27:49Z","content":"India completes a month in lockdown on Saturday. In this period, the country has slowed the spread of the coronavirus disease (Covid-19) though many challenges still remain. Meanwhile, human trials of a vaccine developed by Oxford University has begun. An Ind… [+5596 chars]"},{"source":{"id":null,"name":"Ourbitcoinnews.com"},"author":null,"title":"Covid19, Second Wave of Corona May Hit India During Rainy Season – Corona Crisis: Second wave of Corona might hit India throughout monsoon - OBN","description":", , New Delhi Updated Sat, 25 Apr 2020 06:36 AM IST Listen to the information Even although India has restricted the affect of the…","url":"https://ourbitcoinnews.com/covid19-second-wave-of-corona-may-hit-india-during-rainy-season-corona-crisis-second-wave-of-corona-may-hit-india-during-monsoon/","urlToImage":null,"publishedAt":"2020-04-25T01:22:00Z","content":"Even although India has restricted the affect of the Corona virus epidemic thats wreaking havoc on a worldwide scale, the Indians might must face the second wave of the epidemic within the upcoming monsoon. Scientists have warned {that a} sudden enhance withi… [+1740 chars]"}]}