{"status":"ok","totalResults":70,"articles":[{"source":{"id":null,"name":"Thestatesman.com"},"author":"SNS Web","title":"‘Olympics in 2021 unrealistic unless COVID-19 vaccine found’ - The Statesman","description":"Olympics is not the only sporting tournament to be pushed back because of the dreaded coronavirus pandemic and high-profile tournaments including the cash-rich Indian Premier League (IPL) have been affected.","url":"https://www.thestatesman.com/sports/olympics-in-2021-unrealistic-unless-covid-19-vaccine-found1502879079-1502879079.html","urlToImage":"https://www.thestatesman.com/wp-content/uploads/2020/03/Tokyo2020.jpg","publishedAt":"2020-04-19T14:41:24Z","content":"Holding the Tokyo Olympics any time before a vaccine is found will be “very unrealistic,” according to a leading global health expert. Professor Devi Sridhar said that the development of the vaccine will be key to when the Olympics can be held.\r\nSridhar, howe… [+1886 chars]"},{"source":{"id":null,"name":"Scoopwhoop.com"},"author":"Dhirendra Kumar","title":"10 DIY Skincare Hacks That Will Help You Get Rid Of Acne - ScoopWhoop","description":"Go Acne Go!","url":"https://www.scoopwhoop.com/health/10-diy-skin-hacks-that-will-help-you-get-rid-of-acne/","urlToImage":"https://s4.scoopwhoop.com/anj2/5e9bf95b18ac8111b319cd90/a26a343b-2a82-4169-bd99-860a945b80a3.jpg","publishedAt":"2020-04-19T14:26:54Z","content":"Do you struggle with acne scars? Acne is normally caused by hormonal changes as a teenager, but it can last much longer. It is one of the most common skin conditions in the world, affecting an estimated 85% of people at some point in their lives. \r\nIf you dis… [+4354 chars]"},{"source":{"id":"bloomberg","name":"Bloomberg"},"author":null,"title":"Sweden Says Controversial Covid-19 Strategy Is Proving Effective - Bloomberg","description":null,"url":"https://www.bloomberg.com/tosv2.html?vid=&uuid=1f3b63e0-824d-11ea-b3c6-3b304d0666ef&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0xOS9zd2VkZW4tc2F5cy1jb250cm92ZXJzaWFsLWNvdmlkLTE5LXN0cmF0ZWd5LWlzLXByb3ZpbmctZWZmZWN0aXZl","urlToImage":null,"publishedAt":"2020-04-19T14:23:45Z","content":"To continue, please click the box below to let us know you're not a robot."},{"source":{"id":null,"name":"Deccanherald.com"},"author":"Sagar Kulkarni","title":"Coronavirus: Centre strongly advises against spraying of disinfectants on people - Deccan Herald","description":"As sanitisation tunnels came up at several places as a response to combat COVID-19, the Health Ministry has strongly advised against spraying of chemical disinfectants on individuals or groups as it could cause physical and mental harm. The advisory said meth…","url":"https://www.deccanherald.com/national/coronavirus-centre-strongly-advises-against-spraying-of-disinfectants-on-people-827399.html","urlToImage":"https://www.deccanherald.com/sites/dh/files/article_images/2020/04/19/dis-1587305887.jpg","publishedAt":"2020-04-19T14:18:07Z","content":"As sanitisation tunnels came up at several places as a response to combat COVID-19, the Health Ministry has strongly advised against spraying of chemical disinfectants on individuals or groups as it could cause physical and mental harm.\r\nThe advisory said met… [+1413 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"IANS","title":"Nobel winning scientist claims Covid-19 virus was man-made in Wuhan lab - Livemint","description":"France's Luc Montagnier says SARS-CoV-2 virus was the result of an attempt to manufacture a vaccine against the AIDS virus.'The Wuhan city laboratory has specialized in these coronaviruses since the early 2000s. They have expertise in this area,' he told a Fr…","url":"https://www.livemint.com/news/world/nobel-winning-scientist-claims-covid-19-virus-was-man-made-in-wuhan-lab-11587303649821.html","urlToImage":"https://images.livemint.com/img/2020/04/19/600x338/20200417024L_1587303738721_1587303750908.jpg","publishedAt":"2020-04-19T13:45:24Z","content":"London: French Nobel prize winning scientist Luc Montagnier has sparked a fresh controversy by claiming that the SARS-CoV-2 virus came from a lab, and is the result of an attempt to manufacture a vaccine against the AIDS virus.In an interview given to French … [+2389 chars]"},{"source":{"id":null,"name":"Theprint.in"},"author":"ANI","title":"3,86,791 Covid-19 tests conducted in India so far: ICMR - ThePrint","description":"Dr Raman R Gangakhedkar, head scientist of ICMR, said of the 37,000 tests conducted on 18 April, 29,287 tests were done in the labs of the ICMR network.","url":"https://theprint.in/india/386791-covid-19-tests-conducted-in-india-so-far-icmr/404801/","urlToImage":"https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/covid-testing-scaled-e1586165716865.jpg","publishedAt":"2020-04-19T12:33:45Z","content":"New Delhi: The Indian Council of Medical Research (ICMR) on Sunday said that a total of3,86,791 COVID-19 tests have been conducted so far in the country. Out of these tests, over 37,000 tests were conducted on April 18 out of which 29,287 tests were done in t… [+1176 chars]"},{"source":{"id":null,"name":"Financialexpress.com"},"author":"FE Online","title":"Coronavirus: Oxford University set to begin UK’s first clinical trials of COVID-19 vaccine by next week - The Financial Express","description":"Scientists at the Oxford university are set to begin the clinical trials of the vaccine against Covid-19 in the coming week.","url":"https://www.financialexpress.com/lifestyle/health/coronavirus-oxford-university-set-to-begin-uks-first-clinical-trials-of-covid-19-vaccine-by-next-week/1933167/","urlToImage":"https://images.financialexpress.com/2020/04/vaccine660-1.jpg","publishedAt":"2020-04-19T11:57:22Z","content":"COVID-19: Oxford University set for UK’s first clinical trials of COVID-19 vaccine! Scientists at the Oxford university are set to begin the clinical trials of the vaccine against Covid-19 in the coming week, Financial Times reported. If all goes well then th… [+2156 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ivana Kottasová, CNN","title":"What you need to know about coronavirus on Sunday, April 19 - CNN","description":"Less than a month ago, Singapore was being hailed as a country that got its coronavirus response right. The city-state seemed to have quashed the epidemic without the need for strict lockdowns.","url":"https://www.cnn.com/2020/04/19/world/coronavirus-newsletter-04-19-20/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg","publishedAt":"2020-04-19T11:45:39Z","content":"A version of this story appeared in the April 19 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every day.\r\n (CNN)Less than a month ago, Singapore was being hailed as a country that got its corona… [+5035 chars]"},{"source":{"id":null,"name":"Ndtv.com"},"author":null,"title":"Global Coronavirus Death Count Tops 160,000: Report - NDTV News","description":"More than 160,000 people have died from the new coronavirus around the world, almost two thirds of them in Europe, according to an AFP tally.","url":"https://www.ndtv.com/world-news/covid-19-outbreak-report-says-global-coronavirus-death-count-tops-160-000-2214474","urlToImage":"https://c.ndtvimg.com/2020-02/8187gaoo_coronavirus-generic_625x300_03_February_20.jpg","publishedAt":"2020-04-19T10:53:05Z","content":"A total of 160,502 fatalities have been registered out of 2,331,318 coronavirus cases. (File)\r\nParis: More than 160,000 people have died from the new coronavirus around the world, almost two thirds of them in Europe, according to an AFP tally at 0940 GMT Sund… [+483 chars]"},{"source":{"id":null,"name":"Bloombergquint.com"},"author":"Suzy Waite","title":"World Health Guru Says Don’t Bet on Covid-19 Vaccine - BloombergQuint","description":"World Health Guru Says Don’t Bet on Covid-19 Vaccine: Observer","url":"https://www.bloombergquint.com/business/world-health-guru-says-don-t-bet-on-covid-19-vaccine-observer","urlToImage":"https://images.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true","publishedAt":"2020-04-19T10:17:19Z","content":""},{"source":{"id":null,"name":"Siasat.com"},"author":"Sameer","title":"Males more vulnerable to COVID-19: Are testicles responsible? - The Siasat Daily","description":"New York: A study claimed that males are more vulnerable to COVID-19 when compared to women. The reason behind this increased risk for males is the presence of testicles that may not only harbor coronavirus but also give sanctuary from the immune system. What…","url":"https://www.siasat.com/males-more-vulnerable-covid-19-are-testicles-responsible-1876362/","urlToImage":"https://cdn.siasat.com/wp-content/uploads/2020/04/testicles-.jpg","publishedAt":"2020-04-19T10:00:00Z","content":"New York: A study claimed that males are more vulnerable to COVID-19 when compared to women. The reason behind this increased risk for males is the presence of testicles that may not only harbor coronavirus but also give sanctuary from the immune system.\r\nWha… [+1183 chars]"},{"source":{"id":null,"name":"Hindustantimes.com"},"author":"Associated Press","title":"Covid-19: ‘It made a world of difference’, says UK doctor treated by ex-students - Hindustan Times","description":"Coronavirus update: Dr. Poorna Gunasekera is especially admiring of the current generation of medical practitioners, of whom he has taught many, for being so much more “humble” than his.","url":"https://www.hindustantimes.com/world-news/covid-19-it-made-a-world-of-difference-says-uk-doctor-treated-by-ex-students/story-mgOZstOqQCi3q7LlZxypeP.html","urlToImage":"https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/19/Pictures/virus-outbreak-britain-doctor-and-students_1abad7ce-8220-11ea-a716-f322ae116ff6.jpg","publishedAt":"2020-04-19T09:49:00Z","content":"At his darkest moment with the coronavirus, Dr. Poorna Gunasekera glimpsed three rays of light.\r\nFollowing a severe deterioration in his Covid-19 symptoms, Gunasekera was rushed to Derriford Hospital in Plymouth, southwest England, in the early hours of March… [+5440 chars]"},{"source":{"id":null,"name":"Timesnownews.com"},"author":"IANS","title":"No guarantee coronavirus vaccine will be developed successfully in coming months - WHO envoy - Times Now","description":"The two vaccines which are in Phase 1 are from CanSino Biological Inc. and Beijing Institute of Biotechnology; and Moderna/the National Institute of Allergy and Infectious Disease (NIAID) in the US.","url":"https://www.timesnownews.com/health/article/no-guarantee-coronavirus-vaccine-will-be-developed-successfully-in-coming-months-who-envoy/580050","urlToImage":"https://imgk.timesnownews.com/story/reuters_vaccine_2.jpg?tr=w-560,h-292,fo-top","publishedAt":"2020-04-19T09:44:19Z","content":"London: The World Health Organization (WHO) special envoy David Nabarro has warned that there is no guarantee that a coronavirus (COVID-19) vaccine can be successfully developed in the coming months.\r\nNabarro who is one of the world's leading experts said tha… [+1889 chars]"},{"source":{"id":null,"name":"Thesun.co.uk"},"author":"Mollie Mansfield","title":"Skin rashes could be potential sign of coronavirus, dermatologists warn - The Sun","description":"","url":"http://www.thesun.co.uk/news/11428583/coronavirus-symptom-skin-rash/","urlToImage":"https://www.thesun.co.uk/wp-content/uploads/2020/04/JS-COMP-NEW-SYMPTOMS-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1","publishedAt":"2020-04-19T08:42:37Z","content":"DERMATOLOGISTS have warned that a skin rash could be a new symptom of the deadly coronavirus.\r\nThe rise of rashes in COVID-19 patients has prompted additional research by doctors.\r\n Skin rashes could be a symptom of the coronavirusCredit: Getty Images - Getty… [+1578 chars]"},{"source":{"id":null,"name":"Deccanherald.com"},"author":"PTI","title":"Genetic variation in immune system may affect coronavirus severity: Study - Deccan Herald","description":"Genetic variability in the human immune system may affect susceptibility to, and severity of disease due to the novel coronavirus, according to a study which may help identify people at higher risk of the disease. The research, published in the Journal of Vir…","url":"https://www.deccanherald.com/science-and-environment/genetic-variation-in-immune-system-may-affect-coronavirus-severity-study-827261.html","urlToImage":"https://www.deccanherald.com/sites/dh/files/article_images/2020/04/19/microbiology-163470_1280-1587284789.jpg","publishedAt":"2020-04-19T08:26:29Z","content":"Genetic variability in the human immune system may affect susceptibility to, and severity of disease due to the novel coronavirus, according to a study which may help identify people at higher risk of the disease.\r\nThe research, published in the Journal of Vi… [+1754 chars]"},{"source":{"id":null,"name":"Hindustantimes.com"},"author":"Sanchita Sharma","title":"Early measures reason for fewer cases in India: WHO regional director - Hindustan Times","description":"India has had fewer cases than it might have because of early and aggressive action to contain the spread of coronavirus disease (Covid-19), said Dr Poonam Khetrapal Singh, regional director, World Health Organization (WHO) South East Asia Region.","url":"https://www.hindustantimes.com/india-news/early-measures-reason-for-fewer-cases-in-india-who-regional-director/story-pzo670PRq3OzBFJjSkRQlK.html","urlToImage":"https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/19/Pictures/covid-19_91a796e2-81df-11ea-a716-f322ae116ff6.jpg","publishedAt":"2020-04-19T07:13:00Z","content":"Fewer cases in India are attributable to early and aggressive action to contain the spread of coronavirus disease (Covid-19), said Dr Poonam Khetrapal Singh, regional director, World Health Organisation, South East Asia Region, of which India is a part.\r\nHigh… [+7097 chars]"},{"source":{"id":null,"name":"Europeansting.com"},"author":"World Economic Forum","title":"What are antibody tests and can they get the world back to work? - The European Sting","description":"This article is brought to you thanks to the collaboration of The European Sting with the World Economic Forum. Author: Harry Kretchmer, Senior Writer, Formative Content Tests are already being use…","url":"https://europeansting.com/2020/04/19/what-are-antibody-tests-and-can-they-get-the-world-back-to-work/","urlToImage":"https://europeansting.files.wordpress.com/2020/04/tests.jpeg","publishedAt":"2020-04-19T06:14:00Z","content":"(Drew Hays, Unsplash)\r\nThis article is brought to you thanks to the collaboration of The European Sting with the World Economic Forum.\r\nAuthor: Harry Kretchmer, Senior Writer, Formative Content\r\n<ul><li>Tests are already being used to test frontline workers i… [+5980 chars]"},{"source":{"id":null,"name":"Nytimes.com"},"author":"James Gorman","title":"Both Acting as Barriers Against Virus That Spreads from 'Healthy' People, Are Face Masks the New Condoms? - News18","description":"If people with no symptoms are spreading the coronavirus, as some studies suggest, it may be time to give face masks the kind of advertising and promotion that support condoms as lifesavers.","url":"https://www.nytimes.com/2020/04/18/health/coronavirus-mask-condom.html","urlToImage":"https://static01.nyt.com/images/2020/04/18/science/18VIRUS-SHEDDING/18VIRUS-SHEDDING-facebookJumbo.jpg","publishedAt":"2020-04-19T05:56:59Z","content":"In another paper, which went online Friday in the journal Science, researchers reported that crab-eating macaques were susceptible to infection by the new coronavirus and that they appeared to be shedding the virus from their bodies almost as soon as they wer… [+1268 chars]"},{"source":{"id":null,"name":"Devdiscourse.com"},"author":"ANI","title":"7 more COVID-19 cases in Nagpur, district tally reaches 72 - Devdiscourse","description":"With 7 more COVID-19 cases, the total number of coronavirus cases in the Nagpur district has reached 72, said the district office on Sunday.","url":"https://www.devdiscourse.com/article/headlines/1014177-7-more-covid-19-cases-in-nagpur-district-tally-reaches-72","urlToImage":"https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/19_04_2020_05_05_53_5774906.jpg?width=920&format=jpeg","publishedAt":"2020-04-19T05:05:56Z","content":"With 7 more COVID-19 cases, the total number of coronavirus cases in the Nagpur district has reached 72, said the district office on Sunday.\r\nAs per the latest update by the Ministry of Health and Family Welfare, Maharashtra has a total of 3,651 positive case… [+441 chars]"},{"source":{"id":null,"name":"Hindustantimes.com"},"author":"HT Correspondent","title":"Covid-19: Staying at home and want to use AC? Here’s what you need to know - Hindustan Times","description":"A recent study in China suggested that air conditioning aided the transmission of coronavirus infection between people in a restaurant.","url":"https://www.hindustantimes.com/india-news/covid-19-staying-at-home-and-want-to-use-ac-here-s-what-you-need-to-know/story-ZToEjpKIT5DuT99xw4wz5M.html","urlToImage":"https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/19/Pictures/virus-outbreak-india_5ceba5dc-81f4-11ea-aedf-4d2519fcedc3.jpg","publishedAt":"2020-04-19T04:36:11Z","content":"As coronavirus disease Covid-19 spreads rapidly, there is a barrage of information floating along with it on what should be used and what shouldn’t to check the spread of the disease.\r\nAmong such information is the use of air conditioners (ACs) - many on the … [+2178 chars]"}]}